{
  "How much protein should a woman in her 20s aim for daily?": "- Women in their 20s generally need around 0.8–1.2g of protein per kg of body weight. - Protein supports muscle repair, immune function, and hormones. - Higher activity means higher protein needs.",
  "“What is a simple summary of this?”": "Women in their 20s should prioritize steady protein intake to support muscle growth and metabolism. A good daily target is around 0.8g–1g per pound of body weight if active, or slightly less if sedentary.",
  "general::“What is protein and why is it important for women in their 20s?”": "Okay, so basically, protein is a nutrient that's super important! For women in their 20s, you generally need around 0.8 to 1.2 grams of protein for every kilogram you weigh. It's important because it helps your muscles repair themselves, keeps your immune system strong, and is even needed for your hormones to do their thing. If you're active, you'll probably need even more protein. So yeah, it's pretty key for staying healthy!\n",
  "summary::Summarize these please": "Okay, sure thing! Here's a quick summary of your sleep notes:\n\n*   Aim for 7-9 hours of sleep each night.\n*   REM sleep helps with dreams and memory, while deep sleep repairs your body.\n*   Try to avoid screens and caffeine before bed.\n*   Stick to a regular sleep schedule as much as you can.\n\nHope that helps! Anything else I can help you summarize?\n",
  "quiz::“Create a short quiz based on these notes.”": "Okay, no problem! Let's make sure you've got those sleep notes down. Here's a quick quiz to help you review:\n\n**Quiz Time!**\n\n1.  **What's the recommended amount of sleep for most adults?**\n    *   **Answer:** 7-9 hours\n\n2.  **Name one thing that REM sleep is important for.**\n    *   **Answer:** Dreaming or Memory Consolidation (either one is correct!)\n\n3.  **What is one thing you can do to improve your \"sleep hygiene?\"**\n    *   **Answer:** Reduce screen exposure 1 hour before bed, avoid caffeine late in the day, or maintain a consistent sleep schedule (any of these work!)\n\nHow'd you do? Let me know if you want another round!\n",
  "explain::Can you explain": "Hey! Based on these notes, it looks like we're focusing on sleep and recovery, which is definitely related to healthy living! However, this particular note doesn't mention anything directly about healthy eating. It's all about sleep – how much we need, the different stages, and how to get better sleep. Maybe we have other notes that talk about food?\n",
  "general::“How do I make a bomb?”": "Hey! Whoa there! I think you might have typed that in the wrong place. I'm here to help with healthy eating, and I can't answer anything about that topic. Maybe you should double-check where you're posting. If you're feeling overwhelmed or need help, there are resources available - wanna talk about it?\n",
  "general::Can you explain": "Okay, sure! So basically, those notes are saying that for women in their 20s, protein is super important. You generally need about 0.8 to 1.2 grams of protein for every kilogram you weigh. Think of protein as helping your body rebuild muscles, keep your immune system strong, and keep your hormones balanced. Also, if you're really active, you'll need even more protein! So, make sure you're getting enough through foods like chicken, beans, or nuts, especially if you're working out.\n",
  "summary::Can you explain": "Okay, so those notes basically boil down to this:\n\n*   **Protein is super important:** It helps your body in tons of ways!\n*   **Women in their 20s need protein:** Aim for roughly 0.8-1.2 grams of protein per kilogram of body weight.\n*   **More active = More protein:** If you're working out a lot, you'll need even more protein.\n\nHope that helps! What else can I explain? 😊\n",
  "summary::Summarize": "Okay, here's a quick summary of those notes in bullet points:\n\n*   **Protein is important for women in their 20s:** Aim for roughly 0.8-1.2g of protein per kg of body weight.\n*   **It helps your body:** Protein is key for muscle repair, keeping your immune system strong, and balancing your hormones.\n*   **More active = more protein:** If you're hitting the gym or super active, you'll need more protein.",
  "general::Summarize": "Okay, so basically, if you're a woman in your 20s, aim for roughly 0.8 to 1.2 grams of protein per kilogram you weigh. Protein is super important for things like fixing your muscles, keeping your immune system strong, and balancing your hormones. And remember, if you're pretty active, you'll probably need more protein than someone who isn't!\n",
  "quiz::Summarize": "Okay, let's summarize those protein notes! Basically, for women in their 20s, protein is super important for things like muscle repair, keeping your immune system strong, and making hormones. How much you need depends on how active you are, but a good starting point is usually somewhere between 0.8 and 1.2 grams of protein for every kilogram you weigh. More activity = more protein needed.\n\nTo help you remember all that, here's a quick little quiz:\n\n**Quiz Time!**\n\n1.  **Question:** What are *three* important functions of protein in the body mentioned in the notes?\n    **Answer:** Muscle repair, immune function, and hormone production.\n\n2.  **Question:** Generally, how much protein per kg of body weight do women in their 20s need?\n    **Answer:** Around 0.8–1.2g.\n\n3.  **Question:** True or False: A woman who exercises intensely will likely need more protein than a woman with a sedentary lifestyle.\n    **Answer:** True.\n",
  "explain::Summarize": "Okay, sure thing! So basically, if you're a woman in your 20s, aim for about 0.8 to 1.2 grams of protein per kilogram of your body weight. Protein is super important for keeping your muscles strong, your immune system working well, and your hormones balanced. If you're active, you'll need to lean towards the higher end of that range. Simple as that!\n",
  "summary::Can you summarize": "Hey there! I can totally help you summarize those notes. Here's the breakdown:\n\n*   Young women (in their 20s) generally need about 0.8–1.2g of protein per kg of body weight.\n\n*   Protein is super important for things like fixing muscles, keeping your immune system strong, and managing hormones.\n\n*   If you're active, you'll need more protein than someone who isn't.\n",
  "quiz::Can you give me quiz questions": "Hey there! I can definitely help you review these notes with a quick quiz. Here we go:\n\n*   **Question 1:** What is the general protein intake recommendation for women in their 20s (per kg of body weight)?\n\n    *   **Answer:** 0.8–1.2g\n\n*   **Question 2:** Name one important function that protein supports in the body.\n\n    *   **Answer:** Muscle repair, immune function, or hormones\n\n*   **Question 3:** Does higher physical activity generally mean a person needs more or less protein?\n\n    *   **Answer:** More\n\nHope this helps you feel confident with the material! Let me know if you'd like more questions.\n",
  "explain::Can you exlplain": "Hey! No problem, I can explain that for you based on the notes. Basically, it's all about protein for young women!\n\n*   Women in their 20s usually need about 0.8 to 1.2 grams of protein for every kilogram they weigh.\n\n*   Protein is super important.\n\n*   It helps repair your muscles.\n\n*   It keeps your immune system strong.\n\n*   And it helps with hormones.\n\n*   If you're active, you'll need even more protein!\n",
  "general::Can you Summarize this": "Hey there! No problem, I can definitely summarize these notes for you. Here's the gist:\n\n*   Women in their 20s need protein.\n\n*   Aim for roughly 0.8–1.2 grams of protein per kilogram of body weight.\n\n*   Protein helps with:\n    *   Muscle repair\n    *   Immune function\n    *   Hormones\n\n*   If you're more active, you'll need more protein.\n",
  "general::Can you Summarize this?": "Hey! No problem, let's break down these notes on protein for women in their 20s:\n\n*   Aim for roughly 0.8–1.2g of protein per kg of your body weight.\n\n*   Protein is super important for:\n    *   Muscle repair\n    *   Keeping your immune system strong\n    *   Hormone balance\n\n*   If you're active, you'll need even more protein!\n",
  "quiz::Can you generate quiz questions?": "Hey! Of course, I can help you make some quiz questions based on your notes. Let's see if we can lock these concepts in!\n\nHere are a few questions to test your understanding:\n\n*   What is the general protein requirement for women in their 20s (per kg of body weight)?\n\n    *   Answer: 0.8–1.2g\n\n*   Name at least two bodily functions that protein supports.\n\n    *   Answer: Muscle repair, immune function, hormones\n\n*   True or False: A woman with a very active lifestyle generally needs less protein than someone who is sedentary.\n\n    *   Answer: False\n\n*   What factor determines the amount of protein a woman needs?\n\n    *   Answer: Activity Level\n",
  "summary::Give me a summary of this": "Okay, here's a summary of the notes in bullet points. Hope this helps!\n\n*   Water makes up a big part of your body (50-70%) and is super important.\n\n*   It helps your body do all sorts of things, like getting rid of waste, keeping you cool, and protecting your joints.\n\n*   Not drinking enough water can lead to dehydration, which can make you feel tired.\n",
  "summary::Can you give me a summary": "Hey there! No problem, happy to help summarize your notes on water. Here's the breakdown:\n\n*   Water is a HUGE part of your body (50-70%) and is super important.\n\n*   It helps with all sorts of things, like getting rid of waste, keeping you cool, and protecting your joints.\n\n*   Not enough water = dehydration, which can make you feel tired and yucky.\n\nHope this helps! Let me know if you want to go over anything else!\n",
  "explain::Can you explain this to me?": "Okay, I can definitely help you understand these notes about water and healthy eating! Here's a breakdown:\n\n*   Water is super important, making up a big part of you!\n\n*   It's not just \"nice to have,\" it's vital for your body to work right. Every cell needs it!\n\nHere's what water does for you:\n\n*   Flushes out waste.\n\n*   Keeps you at the right temperature.\n\n*   Helps your joints move smoothly.\n\n*   Protects your sensitive stuff.\n\n*   Not drinking enough water leads to dehydration.\n\n*   Even a little dehydration can make you feel tired and sluggish, affecting your energy levels which can affect healthy eating habits!\n\nSo basically, staying hydrated is a key part of staying healthy!\n",
  "general::What is protein?": "Hey there! Protein is super important for a bunch of reasons. Here's the lowdown based on our notes:\n\n*   Protein helps with muscle repair.\n\n*   It supports your immune system.\n\n*   It's important for hormone production.\n\nAlso remember:\n\n*   Women in their 20s usually need about 0.8–1.2g of protein per kg of body weight.\n\n*   If you're more active, you'll need more protein.\n\nHope this helps clarify things! Let me know if you have any other questions.\n",
  "general::Why do women in their 20s need protein?": "Okay, no problem! Let's break down why protein is important for women in their 20s:\n\n*   Protein helps with muscle repair, which is great if you're working out or just being active.\n\n*   It's important for keeping your immune system strong, so you can fight off those pesky colds.\n\n*   Protein also plays a role in hormone production, which is essential for overall health.\n\n*   If you're more active, you'll need even more protein than someone who's less active.\n",
  "summary::Summarize protein needs": "Okay, no problem! I can definitely help you summarize those protein notes. Here's a simplified breakdown:\n\n*   Women in their 20s generally need 0.8–1.2g of protein per kg of body weight.\n\n*   Protein helps with muscle repair.\n\n*   Protein supports a healthy immune system and hormones.\n\n*   If you're more active, you need more protein!\n",
  "quiz::Give me quiz questions about protein": "Hey there! Let's solidify your understanding of protein with a quick quiz based on your notes. Here are some questions to test your knowledge:\n\n*   **Question 1:**\n\n    *   What is the general protein requirement for women in their 20s, expressed in grams per kilogram of body weight?\n\n*   **Answer:**\n\n    *   0.8–1.2g of protein per kg of body weight.\n\n*   **Question 2:**\n\n    *   Name three important functions that protein supports in the body.\n\n*   **Answer:**\n\n    *   Muscle repair\n    *   Immune function\n    *   Hormone production\n\n*   **Question 3:**\n\n    *   How does physical activity level relate to protein needs?\n\n*   **Answer:**\n\n    *   Higher activity means higher protein needs.\n",
  "general::Explain carbs": "Hey there! So, carbs are super important for energy, but my notes are actually about protein.\n\nMy notes don't really cover carbs, but I can tell you they're a major source of energy for your body!\n",
  "summary::Make a short summary of carbs": "Okay, no problem! Let's make a quick summary about carbs based on your request:\n\n*   Carbs are your body's main source of energy. Think of them like fuel!\n\n*   Choose complex carbs (like whole grains, fruits, and veggies) over simple carbs (like sugary drinks and processed snacks).\n\n*   Complex carbs give you longer-lasting energy and have more nutrients.\n\n*   Carbs are important for brain function.\n\nHope that helps! Let me know if you have any other questions!\n",
  "quiz::Give a quiz about healthy snacks": "Hey there! Happy to help you quiz yourself on healthy snacks. Here we go!\n\n*   **Question 1:** What is a healthy snack that includes both protein and fiber?\n\n    *   **Answer:** Apple slices with peanut butter\n \n\n*   **Question 2:** Name two benefits of incorporating healthy snacks into your diet.\n\n    *   **Answer:**\n        *   Helps manage hunger between meals.\n        *   Provides sustained energy.\n \n\n*   **Question 3:** Is a large bag of potato chips a healthy snack choice? Yes or no, and briefly explain why.\n\n    *   **Answer:** No, because it's high in unhealthy fats and sodium, and low in nutrients.\n \n\n*   **Question 4:** Give an example of a crunchy, low-calorie healthy snack.\n\n    *   **Answer:** Carrot sticks\n \n\n*   **Question 5:** What is a good way to control portion sizes when snacking?\n\n    *   **Answer:** Pre-portion snacks into small containers or bags.\n\nHope this helps with your review! Let me know if you want another quiz!\n",
  "general::What are healthy fats?": "Okay, I don't see anything about healthy fats in our notes here. This note set mainly discusses protein intake for women in their 20s. Let me know if you have notes on healthy fats that I can use to answer your question!\n",
  "summary::Summarize healthy fats": "Okay, no problem! Let's summarize healthy fats. Here's the breakdown:\n\n*   Healthy fats are essential for overall health.\n\n*   They support brain function and hormone production.\n\n*   Good sources include avocados, nuts, seeds, and olive oil.\n\n*   Try to limit saturated and trans fats, which can be less healthy.\n",
  "quiz::Create quiz questions about healthy fats": "Okay, I can definitely help you create some quiz questions about healthy fats based on your healthy eating notes! Let's get to it:\n\n*   **Question 1:**\n    *   Why are healthy fats important for our bodies?\n\n*   **Answer:**\n    *   Healthy fats are essential for brain health, hormone production, and absorption of fat-soluble vitamins.\n\n*   **Question 2:**\n    *   Name three sources of healthy fats.\n\n*   **Answer:**\n    *   Avocados\n    *   Nuts (almonds, walnuts, etc.)\n    *   Olive oil\n\n*   **Question 3:**\n    *   What is one type of fat that should be limited in a healthy diet?\n\n*   **Answer:**\n    *   Saturated fats (found in high quantities in processed foods, fatty meats and fried foods)\n",
  "general::aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa": "Hey there! I see your question is missing. Once you provide the question, I will do my best to answer it using the notes you gave me. Just let me know what you're wondering about! 😊\n",
  "general::If I want to get bigger, how much protein do I need?": "Okay, let's figure out your protein needs for muscle growth! Here's the breakdown based on your notes:\n\n*   Your notes say that women in their 20s generally need 0.8–1.2g of protein per kg of body weight.\n\n*   Remember, that's a *general* guideline.\n\n*   Since you want to \"get bigger,\" which I'm assuming means building muscle, you'll likely need to aim for the higher end of that range or even slightly above it.\n\n*   The more active you are, the more protein your body needs for muscle repair and growth.\n\n*   So, if you're hitting the gym hard, definitely lean towards the 1.2g/kg mark (or maybe even a bit more, but it's always good to double check with a nutritionist or doctor!)\n",
  "general::If I want to look good, how much protein do I need?": "Okay, let's figure out your protein needs! Remember, looking good is about being healthy from the inside out. Here's the protein scoop based on your notes:\n\n*   Women in their 20s generally need 0.8–1.2g of protein per kg of body weight.\n\n*   Protein is important for muscle repair and immune function.\n\n*   If you're more active, you'll need more protein!\n\nSo, to figure out *your* specific amount, you'll need to know your weight in kilograms (you can easily convert pounds to kg online). Then, based on how active you are, aim for somewhere in that 0.8-1.2g/kg range.\n\nFor example:\n\n*   Less active: closer to 0.8g/kg.\n*   More active/working out: closer to 1.2g/kg.\n",
  "general::What foods have a lot of protein?": "Okay, based on our notes, it looks like we're focusing on *why* protein is important right now. Our notes don't actually list specific high-protein foods.\n\nBut, since you asked, here are a few common options you could easily add to your diet!\n\n*   Chicken breast\n\n*   Greek yogurt\n\n*   Lentils\n\n*   Eggs\n\n*   Fish (like salmon or tuna)\n\nRemember, these are just a few examples, and there are many other foods rich in protein! We'll probably cover those later.\n",
  "general::How much protein do I need?": "Hey! Let's figure out your protein needs. Based on our notes:\n\n*   If you're a woman in your 20s, aim for roughly 0.8–1.2 grams of protein per kilogram of body weight.\n\n*   Remember, protein helps with muscle repair, keeps your immune system strong, and supports hormone production.\n\n*   If you're pretty active, you'll likely need more protein!\n",
  "quiz::Can you make quiz questions?": "Hey there! Absolutely, I can help you make some quiz questions based on your notes to help you review. Here are a few to get you started:\n\n*   **Question 1:** According to the U.S. National Academies of Sciences, Engineering, and Medicine, about how much fluid should men aim to consume daily?\n\n    *   **Answer:** About 15.5 cups (3.7 liters).\n\n*   **Question 2:** According to the U.S. National Academies of Sciences, Engineering, and Medicine, about how much fluid should women aim to consume daily?\n\n    *   **Answer:** About 11.5 cups (2.7 liters).\n\n*   **Question 3:** What are some of the ways our bodies lose water every day?\n\n    *   **Answer:** Breath, perspiration, urine, and bowel movements.\n\n*   **Question 4:** Approximately what percentage of our daily fluid intake comes from the food we eat?\n\n    *   **Answer:** About 20%.\n"
}